app/views/searches/_display.html.erb

SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = ?  [["user_id", 6]]
SELECT  1 AS one FROM "searches" WHERE "searches"."user_id" = ? LIMIT ?  [["user_id", 7], ["LIMIT", 1]]
---
                <div class="mt-0">
                    <% if !current_user.searches.empty? %>

SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = ?  [["user_id", 6]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" IN (SELECT "searches"."answer_id" FROM "searches" WHERE "searches"."user_id" = ?)  [["user_id", 7]]
---
                        <%= form_for(:search, url: '/show_answer') do |f| %>
                            <%= f.collection_select :answer_id, Answer.find_user_answers(current_user.searches), :id, :title %>