app/views/searches/index.html.erb

SELECT  "searches".* FROM "searches" ORDER BY "searches"."id" DESC LIMIT ?  [["LIMIT", 5]]
---
    <% if request.referer.include?("/searches/new") %>
        <%= render 'searches', searches: Search.all.last(5)%>