app/controllers/answers_controller.rb

    def show_answer
        # binding.pry
        # find the answer selected in the dropwdown menu
        answer = Answer.find_by(id: params[:search][:answer_id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]