app/controllers/searches_controller.rb

    def create
        tags = params[:search][:tags]
        url = api_endpoint_builder(tags)
        response = HTTParty.get(url)
        # binding.pry

        if response['items'].empty?
            flash[:alert] = "No answers were found for the search tags provided. Please try a different combination of search tags."
            render :new
        else
            # create 5 search & answer objects
            5.times do |i|
                answer = Answer.create(
                    title: response['items'][i]['title'],
                    post_link: response['items'][i]['link'],
                    accepted_answer_id: response['items'][i]['accepted_answer_id'],
                )
                search = current_user.searches.build(
                    answer_id: answer.id,
                    tags: tags
                )
                search.save
---
INSERT INTO "answers" ("accepted_answer_id", "title", "post_link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "searches" ("user_id", "answer_id", "tags", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["answer_id", 2], ["tags", "[\"python\", \"dictionary\", \"sorting\"]"], ["created_at", "2019-08-09 18:11:07.267024"], ["updated_at", "2019-08-09 18:11:07.267024"]]