app/controllers/searches_controller.rb

INSERT INTO "answers" ("accepted_answer_id", "title", "post_link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "answers".* FROM "answers" WHERE "answers"."accepted_answer_id" = ? AND "answers"."title" = ? AND "answers"."post_link" = ? LIMIT ?  [["accepted_answer_id", 613218], ["title", "How do I sort a dictionary by value?"], ["post_link", "https://stackoverflow.com/questions/613183/how-do-i-sort-a-dictionary-by-value"], ["LIMIT", 1]]
SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = ? AND "searches"."answer_id" = ?  [["user_id", 1], ["answer_id", 2]]
SELECT  1 AS one FROM "searches" WHERE "searches"."user_id" = ? AND "searches"."answer_id" = ? LIMIT ?  [["user_id", 2], ["answer_id", 1], ["LIMIT", 1]]
---
    def create
        tags = params[:search][:tags]
        @recent_searches = []
        if tags.any? {|x| x.empty?}
            @user = current_user
            @search = Search.new
            flash[:alert] = "Tag fields cannot be empty. Please fill out each tag."
            # render :new
            redirect_to new_user_search_path
        else
            url = api_endpoint_builder(tags)
            response = HTTParty.get(url)
            # binding.pry

            if response['items'].empty?
                @user = current_user
                @search = Search.new
                flash[:alert] = "No answers were found for the search tags provided. Please try a different combination of search tags."
                # render :new
                redirect_to new_user_search_path
            else
                # create 5 search & answer objects
                5.times do |i|
                    answer = Answer.find_or_create_by(
                        accepted_answer_id: response['items'][i]['accepted_answer_id'],
                        title: response['items'][i]['title'],
                        post_link: response['items'][i]['link']
                    )
                    # binding.pry
                    if Search.find_duplicates(answer, current_user).empty?

INSERT INTO "searches" ("user_id", "answer_id", "tags", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["answer_id", 11], ["tags", "[\"ruby\", \"arrays\", \"object\"]"], ["created_at", "2019-08-09 22:18:47.320358"], ["updated_at", "2019-08-09 22:18:47.320358"]]
SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = ? AND "searches"."answer_id" = ?  [["user_id", 1], ["answer_id", 2]]
---
                            answer_id: answer.id,
                            tags: tags
                        )
                        search.save
                    else
                        search = Search.find_duplicates(answer, current_user)