app/controllers/sessions_controller.rb

    def create
        binding.pry

        if auth_hash
            @user = User.find_by(username: auth_hash['info']['nickname'])

            if @user.nil?
                @user = User.create(username: auth_hash['info']['nickname'], password: SecureRandom.hex)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Bav75"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)