app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "jackdaboy"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
   def create

    if User.find_by(username: params[:user][:username])
        flash[alert] = "This username already exists. Please try a different username."
        redirect_to new_user_path
    else
        @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
   def show
    @user = User.find(session[:user_id].to_i)

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Bav75"], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Bee"], ["password_digest", "$2a$12$W3G4OHbPy1aakZfCcz581ullV596L7.g0GviaFVOztWbQeT4HmeYe"], ["updated_at", "2019-08-12 00:52:10.805174"], ["id", 2]]
---
   def update
    if User.find_by(username: params[:user][:username]) && params[:user][:username] != current_user.username
        flash[alert] = "This username already exists. Please try a different username."
        redirect_to edit_user_path(current_user)
    else
        if current_user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
   def destroy
    current_user.destroy