app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Bav75"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def self.find_or_create_from_oauth(auth_hash)
        user = self.find_by(username: auth_hash['info']['nickname'])

        if user.nil?
            user = User.create(username: auth_hash['info']['nickname'], password: SecureRandom.hex)